app/controllers/friends_controller.rb

  def index
    @friends = Friend.all
---
SELECT "friends".* FROM "friends"

  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)
    respond_to do |format|
      if @friend.save
---
INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "facebook", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @friend.update(friend_params)
---
UPDATE "friends" SET "phone" = ?, "facebook" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["phone", "567898123"], ["facebook", "jojomenaCe"], ["updated_at", "2021-03-30 09:21:40.195994"], ["id", 14]]

  def destroy
    @friend.destroy
---
DELETE FROM "friends" WHERE "friends"."id" = ?  [["id", 3]]

  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ? AND "friends"."id" = ? LIMIT ?  [["user_id", 5], ["id", 14], ["LIMIT", 1]]

    def set_friend
      @friend = Friend.find(params[:id])
---
SELECT "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]